mixerVesselAMI/vis_mixerVesselAMI/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    vessel
    {
        type            wall;
        inGroups        2(meshedWalls wall);
        nFaces          45978;
        startFace       2607878;
    }
    gasInlet
    {
        type            patch;
        nFaces          832;
        startFace       2653856;
    }
    outlet
    {
        type            patch;
        nFaces          109;
        startFace       2654688;
    }
    shaftRotating
    {
        type            wall;
        inGroups        2(meshedWalls wall);
        nFaces          2228;
        startFace       2654797;
    }
    shaft
    {
        type            wall;
        inGroups        2(meshedWalls wall);
        nFaces          648;
        startFace       2657025;
    }
    sparger
    {
        type            wall;
        inGroups        2(meshedWalls wall);
        nFaces          1460;
        startFace       2657673;
    }
    stirrer
    {
        type            wall;
        inGroups        2(meshedWalls wall);
        nFaces          6014;
        startFace       2659133;
    }
    baffles
    {
        type            wall;
        inGroups        2(meshedWalls wall);
        nFaces          2712;
        startFace       2665147;
    }
    AMI1
    {
        type            cyclicAMI;
        inGroups        2(cyclicAMI rotating);
        nFaces          41828;
        startFace       2667859;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI2;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    AMI2
    {
        type            cyclicAMI;
        inGroups        2(cyclicAMI rotating);
        nFaces          41828;
        startFace       2709687;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI1;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
)

// ************************************************************************* //
